## 연습문제

In [1]:
import numpy as np 
import pandas as pd

### 1. Iris - sns.dataset('iris')

In [2]:
import seaborn as sns
iris = sns.load_dataset("iris")

In [3]:
# 원본 데이터
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

#### a. 붓꽃 종 별로 꽃잎길이, 꽃잎 폭, 꽃받침길이, 꽃받침폭의 평균, 표준편차 등 기초통계량을 구하시오.

In [54]:
df1 = iris.groupby(iris.species).describe()
df1

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

#### b. 3분위수(Q3)와 1분위수(Q1)의 차이보다 1.5배가 크거나 작은 데이터는 이상치이다. 
- Q1 - 1.5 * (Q3 - Q1) 보다 작은 데이터
- Q3 + 1.5 * (Q3 - Q1) 보다 큰 데이터
#### 이상치를 제거하고 위의 4가지 항목에 대해서 평균, 표준편차를 구하시오.

KeyError: 'petal_length'

### 2. Titanic - sns.load_dataset('titanic')

In [61]:
# 원본 데이터
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

#### b. 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 고치시오.

In [63]:
titanic.age = titanic.age.fillna(round(titanic.age.mean(), 2))
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

#### a. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오.
- 20살이 넘으면 성별을 그대로 사용한다.
- 20살 미만이면 성별에 관계없이 "child" 라고 한다.

In [64]:
titanic['category1'] = titanic.apply(lambda x: x.sex if x.age >= 20 else 'child', axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

#### c. 성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

In [127]:
# 성별 생존율
df_sex = titanic.groupby(['sex', 'alive'])[['alive']].count()
df_sex['alive_ratio'] = df_sex['alive'] / df_sex.groupby('sex')['alive'].sum()
df_sex

              alive  alive_ratio
sex    alive
female no        81     0.257962
       yes      233     0.742038
male   no       468     0.811092
       yes      109     0.188908

In [128]:
# 선실별 생존율
df_class = titanic.groupby(['class', 'alive'])[['alive']].count()
df_class['alive_ratio'] = df_class['alive'] / df_class.groupby('class')['alive'].sum()
df_class

              alive  alive_ratio
class  alive
First  no        80     0.370370
       yes      136     0.629630
Second no        97     0.527174
       yes       87     0.472826
Third  no       372     0.757637
       yes      119     0.242363

In [129]:
# 출발지별 생존율
df_embark = titanic.groupby(['embark_town', 'alive'])[['alive']].count()
df_embark['alive_ratio'] = df_embark['alive'] / df_embark.groupby('embark_town')['alive'].sum()
df_embark

                   alive  alive_ratio
embark_town alive
Cherbourg   no        75     0.446429
            yes       93     0.553571
Queenstown  no        47     0.610390
            yes       30     0.389610
Southampton no       427     0.663043
            yes      217     0.336957

#### d. 타이타닉호 승객을 나이 그룹으로 나누고, 각 그룹별 생존율을 구하시오.

In [130]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
df1 = titanic

In [131]:
df1['age_cat'] = pd.cut(df1.age, bins, labels=labels)
df1.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,age_cat
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male,청년
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,미성년자
888,0,3,female,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female,청년
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male,청년
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male,중년

In [134]:
df2 = df1.groupby(['age_cat', 'alive'])[['alive']].count()
df2['alive_ratio'] = df2['alive'] / df2.groupby('age_cat')['alive'].sum()
df2

               alive  alive_ratio
age_cat alive
미성년자    no        95     0.575758
        yes       70     0.424242
청년      no       271     0.665848
        yes      136     0.334152
중년      no       139     0.576763
        yes      102     0.423237
장년      no        38     0.644068
        yes       21     0.355932
노년      no         4     0.800000
        yes        1     0.200000